Ran Plan for project: `seagl` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_db_instance.pretalx will be updated in-place
~ resource "aws_db_instance" "pretalx" {
        id                                    = "pretalx-prod"
        name                                  = "pretalx"
        tags                                  = {}
        # (52 unchanged attributes hidden)
    }

  # module.prod_db.aws_secretsmanager_secret_version.osem-db-pass-val will be updated in-place
~ resource "aws_secretsmanager_secret_version" "osem-db-pass-val" {
        id             = "arn:aws:secretsmanager:us-west-2:663166083306:secret:db-pass-osem-5KW1mS|5E8ED816-E9AA-4E8E-A382-2EEE9FC74A66"
        # (5 unchanged attributes hidden)
    }

  # module.prod_db.random_password.osem_db_master_pass will be updated in-place
~ resource "random_password" "osem_db_master_pass" {
        id               = "none"
        # (14 unchanged attributes hidden)
    }

  # module.production_env.aws_route53_record.mailu-autoconfig-cname["autoconfig"] will be created
+ resource "aws_route53_record" "mailu-autoconfig-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "autoconfig.seagl.org"
      + records         = [
          + "mail.seagl.org.",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.production_env.aws_route53_record.mailu-autoconfig-cname["autodiscover"] will be created
+ resource "aws_route53_record" "mailu-autoconfig-cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "autodiscover.seagl.org"
      + records         = [
          + "mail.seagl.org.",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.production_env.aws_route53_record.mailu-autoconfig-srv["_autodiscover._tcp"] will be created
+ resource "aws_route53_record" "mailu-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_autodiscover._tcp.seagl.org"
      + records         = [
          + "10 1 443 mail.seagl.org.",
        ]
      + ttl             = 600
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.production_env.aws_route53_record.mailu-autoconfig-srv["_imaps._tcp"] will be created
+ resource "aws_route53_record" "mailu-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imaps._tcp.seagl.org"
      + records         = [
          + "10 1 993 mail.seagl.org.",
        ]
      + ttl             = 600
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.production_env.aws_route53_record.mailu-autoconfig-srv["_pop3s._tcp"] will be created
+ resource "aws_route53_record" "mailu-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3s._tcp.seagl.org"
      + records         = [
          + "10 1 995 mail.seagl.org.",
        ]
      + ttl             = 600
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.production_env.aws_route53_record.mailu-autoconfig-srv["_submissions._tcp"] will be created
+ resource "aws_route53_record" "mailu-autoconfig-srv" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_submissions._tcp.seagl.org"
      + records         = [
          + "10 1 465 mail.seagl.org.",
        ]
      + ttl             = 600
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.production_env.aws_route53_record.mailu-autoconfig-srv-null["_imap._tcp"] will be created
+ resource "aws_route53_record" "mailu-autoconfig-srv-null" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_imap._tcp.seagl.org"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 600
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.production_env.aws_route53_record.mailu-autoconfig-srv-null["_pop3._tcp"] will be created
+ resource "aws_route53_record" "mailu-autoconfig-srv-null" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_pop3._tcp.seagl.org"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 600
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.production_env.aws_route53_record.mailu-autoconfig-srv-null["_submission._tcp"] will be created
+ resource "aws_route53_record" "mailu-autoconfig-srv-null" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_submission._tcp.seagl.org"
      + records         = [
          + "0 0 0 .",
        ]
      + ttl             = 600
      + type            = "SRV"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.production_env.module.docker-cluster-vm.openstack_compute_instance_v2.instance will be updated in-place
~ resource "openstack_compute_instance_v2" "instance" {
        id                  = "a73c3200-c6b5-47a6-a699-875cd67b445d"
        name                = "docker-cluster"
        tags                = []
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.production_env.module.dokku-vm.openstack_compute_instance_v2.instance will be updated in-place
~ resource "openstack_compute_instance_v2" "instance" {
        id                  = "c9cea52c-d27f-4fd6-a676-eee301b9c9d7"
        name                = "dokku"
        tags                = []
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.production_env.module.mailu-vm.openstack_compute_instance_v2.instance will be updated in-place
~ resource "openstack_compute_instance_v2" "instance" {
        id                  = "c388c80b-fa29-40fe-ae0b-e93803e87b22"
        name                = "mailu"
        tags                = []
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.production_env.module.shell-vm.openstack_compute_instance_v2.instance will be updated in-place
~ resource "openstack_compute_instance_v2" "instance" {
        id                  = "34b4bed0-0b91-4205-a10b-96d7b3f55bf1"
        name                = "shell"
        tags                = []
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 9 to add, 7 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
│   on provider.tf line 34, in provider "openstack":
│   34: provider "openstack" {
│ 
│ Users not using loadbalancer resources can ignore this message. Support for
│ neutron-lbaas will be removed on next major release. Octavia will be the
│ only supported method for loadbalancer resources. Users using octavia will
│ have to remove 'use_octavia' option from the provider configuration block.
│ Users using neutron-lbaas will have to migrate/upgrade to octavia.
│ 
│ (and 5 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p seagl`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.seagl.org/lock?id=SeaGL%252Fseagl-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p seagl`
</details>
Plan: 9 to add, 7 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`